zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_pwr.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_ll_pwr.h
  * @author  MCD Application Team
  * @brief   Header file of PWR LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP2xx_LL_PWR_H
#define STM32MP2xx_LL_PWR_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx.h"

/** @addtogroup STM32MP2xx_LL_Driver
  * @{
  */

#if defined(PWR)

/** @defgroup PWR_LL PWR
  * @{
  */


/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/** @defgroup PWR_LL_Private_Constants PWR Private Constants
  * @{
  */
#define WIO_CID_CFG_ADD_OFFSET 0x02u
#define R_CID_CFG_ADD_OFFSET   0x01u
#define WKUPCR_ADD_OFFSET      0x01u
#define REGISTER_ADD_OFFSET    0x01u
/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Constants PWR Exported Constants
  * @{
  */
#define LL_PWR_VDDIO              ( (0U<<16U) | (0U<<8U) | (0U) )
#define LL_PWR_VDDIO3             ( (0U<<16U) | (1U<<8U) | (0U) )
#define LL_PWR_VDDIO4             ( (0U<<16U) | (2U<<8U) | (1U) )
#define LL_PWR_USB33              ( (0U<<16U) | (2U) )
#define LL_PWR_UCPD               ( (0U<<16U) | (3U) )
#define LL_PWR_ADC                ( (0U<<16U) | (4U) )
#define LL_PWR_VDDIO1             ( (7U<<16U) | (0U) )
#define LL_PWR_VDDIO2             ( (6U<<16U) | (0U) )

#define LL_PWR_VRSEL_3V3            0x0U
#define LL_PWR_VRSEL_1V8            PWR_CR7_VDDIO2VRSEL

#define IS_PWR_SUPPLY(XX) (((XX) == (LL_PWR_VDDIO3))         || ((XX) == (LL_PWR_VDDIO4))  || \
                           ((XX) == (LL_PWR_USB33))          || ((XX) == (LL_PWR_UCPD))    || \
                           ((XX) == (LL_PWR_ADC))            || ((XX) == (LL_PWR_VDDIO1))  || \
                           ((XX) == (LL_PWR_VDDIO))            || ((XX) == (LL_PWR_VDDIO2))     )

#define IS_PWR_SUPPLY_1V8_OPTIMIZATION_CAPABLE(XX) (((XX) == (LL_PWR_VDDIO3))  || ((XX) == (LL_PWR_VDDIO4))      || \
                                                    ((XX) == (LL_PWR_VDDIO))   || ((XX) == (LL_PWR_VDDIO1))      || \
                                                    ((XX) == (LL_PWR_VDDIO2))         )

#define IS_PWR_SUPPLY_VRSELRSTBY_CAPABLE(XX) (((XX) == (LL_PWR_VDDIO1))   || ((XX) == (LL_PWR_VDDIO2)))


#define LL_PWR_CPU_RESET   0x0U
#define LL_PWR_CPU_CRUN    0x1U
#define LL_PWR_CPU_CSLEEP  0x2U
#define LL_PWR_CPU_CSTOP   0x3U

#define LL_PWR_DRUN       0x0U
#define LL_PWR_DSTOP1     0x1U
#define LL_PWR_DSTOP2     0x2U
#define LL_PWR_DSTOP3     0x3U
#define LL_PWR_DSTANDBY   0x4U


#define LL_PWR_RUN        0x0U
#define LL_PWR_STOP       0x1U
#define LL_PWR_LP_STOP    0x2U
#define LL_PWR_LPLV_STOP  0x3U
#define LL_PWR_STANDY     0x4U
#define LL_PWR_VBAT       0x5U


#define LL_PWR_SRUN1      0x0U
#define LL_PWR_SRUN2      0x1U
#define LL_PWR_SRUN3      0x2U
#define LL_PWR_SSTOP1     0x3U
#define LL_PWR_SSTOP2     0x4U
#define LL_PWR_SSTANDBY   0x5U


#define LL_PWR_RETRAM_SUPPLY_DISABLE       0U /*RETRAM not powered by backup supply*/
#define LL_PWR_RETRAM_SUPPLY_STBY_VBAT     1U /*RETRAM powered by backup supply in standby and Vbat mode*/
#define LL_PWR_RETRAM_SUPPLY_STBY          2U /*RETRAM powered by backup supply in standby only*/


#define LL_PWR_WAKEUP_PIN_PIN1    0U
#define LL_PWR_WAKEUP_PIN_PIN2    1U
#define LL_PWR_WAKEUP_PIN_PIN3    2U
#define LL_PWR_WAKEUP_PIN_PIN4    3U
#define LL_PWR_WAKEUP_PIN_PIN5    4U
#define LL_PWR_WAKEUP_PIN_PIN6    5U
#define LL_PWR_WAKEUP_PIN_NB      6U


#define LL_PWR_WAKEUP_PIN_NOPULL               0U
#define LL_PWR_WAKEUP_PIN_PULLUP               1U
#define LL_PWR_WAKEUP_PIN_PULLDOWN             2U
#define LL_PWR_WAKEUP_PIN_MAX_PULL_CONFIG      3U

#define    LL_WIO1     LL_PWR_WAKEUP_PIN_PIN1
#define    LL_WIO2     LL_PWR_WAKEUP_PIN_PIN2
#define    LL_WIO3     LL_PWR_WAKEUP_PIN_PIN3
#define    LL_WIO4     LL_PWR_WAKEUP_PIN_PIN4
#define    LL_WIO5     LL_PWR_WAKEUP_PIN_PIN5
#define    LL_WIO6     LL_PWR_WAKEUP_PIN_PIN6

#define    LL_R0                   0U
#define    LL_R1                  (LL_R0 + 1U)
#define    LL_R2                  (LL_R0 + 2U)
#define    LL_R3                  (LL_R0 + 3U)
#define    LL_R4                  (LL_R0 + 4U)
#define    LL_R5                  (LL_R0 + 5U)
#define    LL_R6                  (LL_R0 + 6U)
#define    LL_NS_RESSOURCE_NB      7U

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Functions PWR Exported Functions
  * @{
  */


/** @defgroup PWR_LL_EF_Configuration Configuration
  * @{
  */

/**
  * @brief  Enable/disable Programmable Voltage Detector
  * @rmtoll CR3    PVDEN       LL_PWR_EnablePVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnablePVD(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_PVDEN);
}
__STATIC_INLINE void LL_PWR_DisablePVD(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_PVDEN);
}

/**
  * @brief  Check if Programmable Voltage Detector is enabled
  * @rmtoll CR3    PVDEN       LL_PWR_IsEnabledPVD
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPVD(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_PVDEN) == (PWR_CR3_PVDEN)) ? 1UL : 0UL);
}

/**
  * @brief  Check if PVD_IN lower than internal REF (PVDO flag set)
  * @rmtoll CR3    PVD0       LL_PWR_IsActiveFlag_PVDO
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_PVDO(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_PVDO) == (PWR_CR3_PVDO)) ? 1UL : 0UL);
}


/**
  * @brief  Enable/Disable/IsEnable   Monitoring on a power supply
  * @rmtoll CR1/CR7/CR8   LL_PWR_EnableSupplyMonitoring/LL_PWR_DisableSupplyMonitoring/LL_PWR_IsSupplyMonitoringEnabled
  * @param  SupplyID This parameter can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO1
  *         @arg @ref LL_PWR_VDDIO2
  *         @arg @ref LL_PWR_VDDIO3
  *         @arg @ref LL_PWR_VDDIO4
  *         @arg @ref LL_PWR_USB33
  *         @arg @ref LL_PWR_UCPD
  *         @arg @ref LL_PWR_ADC
  */
__STATIC_INLINE void LL_PWR_EnableSupplyMonitoring(uint32_t SupplyID)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->CR1 + (REGISTER_ADD_OFFSET * (SupplyID >> 16));
  SET_BIT(*regaddr, (((uint32_t)PWR_CR7_VDDIO2VMEN) << (SupplyID & 0xFU)));
}
__STATIC_INLINE void LL_PWR_DisableSupplyMonitoring(uint32_t SupplyID)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->CR1 + (REGISTER_ADD_OFFSET * (SupplyID >> 16));
  CLEAR_BIT(*regaddr, (((uint32_t)PWR_CR7_VDDIO2VMEN) << (SupplyID & 0xFU)));
}

__STATIC_INLINE uint32_t LL_PWR_IsSupplyMonitoringEnabled(uint32_t SupplyID)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->CR1 + (REGISTER_ADD_OFFSET * (SupplyID >> 16));
  return ((READ_BIT(*regaddr, (((uint32_t)PWR_CR7_VDDIO2VMEN) << (SupplyID & 0xFU))) == \
           (((uint32_t)PWR_CR7_VDDIO2VMEN) << (SupplyID & 0xFU))) ? 1UL : 0UL);
}


/**
  * @brief  Check if  supply is ready i.e its voltage equal or greater than internal threshold (flag  ready set)
  * @rmtoll CR0/CR7/CR8            LL_PWR_IsSupplyReady
  * @param  SupplyID This parameter can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO1
  *         @arg @ref LL_PWR_VDDIO2
  *         @arg @ref LL_PWR_VDDIO3
  *         @arg @ref LL_PWR_VDDIO4
  *         @arg @ref LL_PWR_USB33
  *         @arg @ref LL_PWR_UCPD
  *         @arg @ref LL_PWR_ADC
  * @retval Return true if supply is ready
  */
__STATIC_INLINE uint32_t LL_PWR_IsSupplyReady(uint32_t SupplyID)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->CR1 + (REGISTER_ADD_OFFSET * (SupplyID >> 16));
  return ((READ_BIT(*regaddr, (((uint32_t)PWR_CR7_VDDIO2RDY) << (SupplyID & 0xFU))) == \
           (((uint32_t)PWR_CR7_VDDIO2RDY) << (SupplyID & 0xFU))) ? 1UL : 0UL);
}


/**
  * @brief  Enable/Disable/IsEnable   Validation on a power supply
  * @rmtoll CR1/CR7/CR8   LL_PWR_EnableSupplyValidation/LL_PWR_DisableSupplyValidation/LL_PWR_IsSupplyValidationEnabled
  * @param  SupplyID This parameter can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO1
  *         @arg @ref LL_PWR_VDDIO2
  *         @arg @ref LL_PWR_VDDIO3
  *         @arg @ref LL_PWR_VDDIO4
  *         @arg @ref LL_PWR_USB33
  *         @arg @ref LL_PWR_UCPD
  *         @arg @ref LL_PWR_ADC
  */
__STATIC_INLINE void LL_PWR_EnableSupplyValidation(uint32_t SupplyID)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->CR1 + (REGISTER_ADD_OFFSET * (SupplyID >> 16));
  SET_BIT(*regaddr, (((uint32_t)PWR_CR7_VDDIO2SV) << (SupplyID & 0xFU)));
}
__STATIC_INLINE void LL_PWR_DisableSupplyValidation(uint32_t SupplyID)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->CR1 + (REGISTER_ADD_OFFSET * (SupplyID >> 16));
  CLEAR_BIT(*regaddr, (((uint32_t)PWR_CR7_VDDIO2SV) << (SupplyID & 0xFU)));
}

__STATIC_INLINE uint32_t LL_PWR_IsSupplyValidationEnabled(uint32_t SupplyID)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->CR1 + (REGISTER_ADD_OFFSET * (SupplyID >> 16));
  return ((READ_BIT(*regaddr, (((uint32_t)PWR_CR7_VDDIO2SV) << (SupplyID & 0xFU))) == \
           (((uint32_t)PWR_CR7_VDDIO2SV) << (SupplyID & 0xFU))) ? 1UL : 0UL);
}


/**
  * @brief  Set   a voltage range selection for a supply
  *         Warning selection of 1V8 is not possible if SoC does not allow it (see fuse-map, HSLV_VDDIOx)
  * @rmtoll CR1/CR7/CR8          LL_PWR_SetVRSEL
  * @param  SupplyID This parameter can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO
  *         @arg @ref LL_PWR_VDDIO1
  *         @arg @ref LL_PWR_VDDIO2
  *         @arg @ref LL_PWR_VDDIO3
  *         @arg @ref LL_PWR_VDDIO4
  * @param  Vrsel This parameter can be one of the following values:
  *         @arg @ref LL_PWR_VRSEL_3V3
  *         @arg @ref LL_PWR_VRSEL_1V8
  */
__STATIC_INLINE void LL_PWR_SetVRSEL(uint32_t SupplyID, uint32_t Vrsel)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->CR1 + (REGISTER_ADD_OFFSET * ((SupplyID >> 16) & 0xFFU));
  MODIFY_REG(*regaddr, ((uint32_t)PWR_CR7_VDDIO2VRSEL) << ((SupplyID >> 8) & 0xFU), Vrsel << ((SupplyID >> 8) & 0xFU));

