zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_pwr.h
}

/**
  * @brief  get  a voltage range selection for a supply
  * @rmtoll CR1/CR7/CR8          LL_PWR_GetVRSEL
  * @param  SupplyID This parameter can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO
  *         @arg @ref LL_PWR_VDDIO1
  *         @arg @ref LL_PWR_VDDIO2
  *         @arg @ref LL_PWR_VDDIO3
  *         @arg @ref LL_PWR_VDDIO4
  * @retval Supply Range Selection, this output can be one of the following values:
  *         @arg @ref LL_PWR_VRSEL_3V3
  *         @arg @ref LL_PWR_VRSEL_1V8
  */
__STATIC_INLINE uint32_t LL_PWR_GetVRSEL(uint32_t SupplyID)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->CR1 + (REGISTER_ADD_OFFSET * ((SupplyID >> 16) & 0xFFU));
  return ((READ_REG(*regaddr) & ((uint32_t)PWR_CR7_VDDIO2VRSEL_Msk << ((SupplyID >> 8) & 0xFU))) >> \
          ((SupplyID >> 8) & 0xFU));

}


/**
  * @brief  Enable/Disable/IsEnableStandbyRangeSelection, request 1.8 voltage in standby and standby exit
            on a power supply, when disable voltage is 3.3 in standby or exit standby
  * @rmtoll CR1/CR7/CR8          LL_PWR_EnableVRSELRSTBY/LL_PWR_DisableVRSELRSTBY
  * @param  SupplyID This parameter can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO1
  *         @arg @ref LL_PWR_VDDIO2
  */
__STATIC_INLINE void LL_PWR_EnableVRSELRSTBY(uint32_t SupplyID)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->CR1 + (REGISTER_ADD_OFFSET * (SupplyID >> 16));
  SET_BIT(*regaddr, (((uint32_t)PWR_CR7_VDDIO2VRSEL) << (SupplyID & 0xFU)));
}
__STATIC_INLINE void LL_PWR_DisableVRSELRSTBY(uint32_t SupplyID)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->CR1 + (REGISTER_ADD_OFFSET * (SupplyID >> 16));
  CLEAR_BIT(*regaddr, (((uint32_t)PWR_CR7_VDDIO2VRSEL) << (SupplyID & 0xFU)));
}

__STATIC_INLINE uint32_t LL_PWR_IsVRSELRSTBYEnabled(uint32_t SupplyID)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->CR1 + (REGISTER_ADD_OFFSET * (SupplyID >> 16));
  return ((READ_BIT(*regaddr, (((uint32_t)PWR_CR7_VDDIO2VRSEL) << (SupplyID & 0xFU))) == \
           (((uint32_t)PWR_CR7_VDDIO2VRSEL) << (SupplyID & 0xFU))) ? 1UL : 0UL);
}


/**
  * @brief  Enable/Disable powering of backupRam thru backup regulation during VBat or standby mode
  * @rmtoll CR9    PWR_CR9_BKPRBSEN       LL_PWR_EnableBkUpRamBkUpRegulator/LL_PWR_DisableBkUpRamBkUpRegulator
  */
__STATIC_INLINE void LL_PWR_EnableBkUpRamBkUpRegulator(void)
{
  SET_BIT(PWR->CR9, PWR_CR9_BKPRBSEN);
}
__STATIC_INLINE void LL_PWR_DisableBkUpRamBkUpRegulator(void)
{
  CLEAR_BIT(PWR->CR9, PWR_CR9_BKPRBSEN);
}

/**
  * @brief  return true if  backupRam is powered during VBat or standby mode
  * @rmtoll CR9    PWR_CR9_BKPRBSEN       LL_PWR_IsEnabledBkUpRamBkUpRegulator
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledBkUpRamBkUpRegulator(void)
{
  return ((READ_BIT(PWR->CR9, PWR_CR9_BKPRBSEN) == (PWR_CR9_BKPRBSEN)) ? 1UL : 0UL);
}


/**
  * @brief  Enable/Disable powering of retram thru backup regulation during VBat and/or standby mode
  * @rmtoll CR10      PWR_CR10_RETRBSEN     LL_PWR_SetRetRamBkUpRegulator/LL_PWR_GetRetRamBkUpRegulator
  * @param  RetentionRamPowerSupplyMode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_RETRAM_SUPPLY_STBY_VBAT i.e  powered by backup supply in standby and Vbat mode
  *         @arg @ref LL_PWR_RETRAM_SUPPLY_STBY      i.e RETRAM powered by backup supply in standby only
  */
__STATIC_INLINE void LL_PWR_SetRetRamBkUpRegulator(uint32_t RetentionRamPowerSupplyMode)
{
  MODIFY_REG(PWR->CR10, PWR_CR10_RETRBSEN, RetentionRamPowerSupplyMode);
}
__STATIC_INLINE uint32_t LL_PWR_GetRetRamBkUpRegulator(void)
{
  return ((READ_REG(PWR->CR10) & PWR_CR10_RETRBSEN) >> PWR_CR10_RETRBSEN_Pos);
}


#if defined(PWR_CR9_LPR1BSEN)
/**
  * @brief  Enable/Disable powering of lpsRam1 thru backup regulation during VBat or standby mode
  * @rmtoll CR9    PWR_CR9_LPR1BSEN       LL_PWR_EnableLpsram1BkUpRegulator/LL_PWR_DisableLpsram1BkUpRegulator
  */
__STATIC_INLINE void LL_PWR_EnableLpsram1BkUpRegulator(void)
{
  SET_BIT(PWR->CR9, PWR_CR9_LPR1BSEN);
}
__STATIC_INLINE void LL_PWR_DisableLpsram1BkUpRegulator(void)
{
  CLEAR_BIT(PWR->CR9, PWR_CR9_LPR1BSEN);
}
/**
  * @brief  return true if  lpsRam1 is powered during VBat or standby mode
  * @rmtoll CR9    PWR_CR9_LPR1BSEN       LL_PWR_IsEnabledLpsram1BkUpRegulator
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledLpsram1BkUpRegulator(void)
{
  return ((READ_BIT(PWR->CR9, PWR_CR9_LPR1BSEN) == (PWR_CR9_LPR1BSEN)) ? 1UL : 0UL);
}
#endif /* defined(PWR_CR9_LPR1BSEN) */

/**
  * @brief  Enable/Disable monitoring of Vbat and temperature
  * @rmtoll CR2    PWR_CR2_MONEN       LL_PWREx_EnableVbatTempMonitoring/LL_PWREx_DisableVbatTempMonitoring
  */
__STATIC_INLINE void LL_PWREx_EnableVbatTempMonitoring(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_MONEN);
}
__STATIC_INLINE void LL_PWREx_DisableVbatTempMonitoring(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_MONEN);
}
/**
  * @brief  return true if  Vbat/Temperature monitoring is enabled
  * @rmtoll CR2    PWR_CR2_MONEN       LL_PWREx_IsEnabledVbatTempMonitoring
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWREx_IsEnabledVbatTempMonitoring(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_MONEN) == (PWR_CR2_MONEN)) ? 1UL : 0UL);
}

/**
  * @brief  return true if temperature level is equal or below low threshold (flag TEMPL set)
  * @rmtoll CR2   TEMPL       LL_PWR_IsActiveFlag_TEMPL
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_TEMPL(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_TEMPL) == (PWR_CR2_TEMPL)) ? 1UL : 0UL);
}

/**
  * @brief  return true if temperature level is equal or above high threshold (flag TEMPH set)
  * @rmtoll CR2   TEMPH       LL_PWR_IsActiveFlag_TEMPH
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_TEMPH(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_TEMPH) == (PWR_CR2_TEMPH)) ? 1UL : 0UL);
}

/**
  * @brief  return true if Vbat level is equal or below low threshold (flag VBATL set)
  * @rmtoll CR2   PWR_CR2_VBATL           LL_PWR_IsActiveFlag_VBATL
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VBATL(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_VBATL) == (PWR_CR2_VBATL)) ? 1UL : 0UL);
}

/**
  * @brief  return true if Vbat level is equal or above high threshold (flag VBATH set)
  * @rmtoll CR2   PWR_CR2_VBATH       LL_PWR_IsActiveFlag_VBATH
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VBATH(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_VBATH) == (PWR_CR2_VBATH)) ? 1UL : 0UL);
}

#if defined (PWR_CR5_VCOREMONEN)
/**
  * @brief  Enable/Disable monitoring of VDDcore
  * @rmtoll CR5    PWR_CR5_VCOREMONEN       LL_PWREx_EnableVDDcoreMonitoring/LL_PWREx_DisableVDDcoreMonitoring
  */
__STATIC_INLINE void LL_PWREx_EnableVDDcoreMonitoring(void)
{
  SET_BIT(PWR->CR5, PWR_CR5_VCOREMONEN);
}
__STATIC_INLINE void LL_PWREx_DisableVDDcoreMonitoring(void)
{
  CLEAR_BIT(PWR->CR5, PWR_CR5_VCOREMONEN);
}
/**
  * @brief  return true if VDDcore monitoring is enabled
  * @rmtoll CR5    PWR_CR5_VCOREMONEN       LL_PWREx_IsEnabledVDDcoreMonitoring
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWREx_IsEnabledVDDcoreMonitoring(void)
{
  return ((READ_BIT(PWR->CR5, PWR_CR5_VCOREMONEN) == (PWR_CR5_VCOREMONEN)) ? 1UL : 0UL);
}

/**
  * @brief  return true if VDDcore level is equal or below low threshold (flag VCOREL set)
  * @rmtoll CR5   PWR_CR5_VCOREL  LL_PWR_IsActiveFlag_VCOREL
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VCOREL(void)
{
  return ((READ_BIT(PWR->CR5, PWR_CR5_VCOREL) == (PWR_CR5_VCOREL)) ? 1UL : 0UL);
}

/**
  * @brief  return true if VDDcore level is equal or above high threshold (flag VCOREH set)
  * @rmtoll CR6   PWR_CR5_VCOREH       LL_PWR_IsActiveFlag_VCOREH
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VCOREH(void)
{
  return ((READ_BIT(PWR->CR5, PWR_CR5_VCOREH) == (PWR_CR5_VCOREH)) ? 1UL : 0UL);
}
#endif /* PWR_CR5_VCOREMONEN */

