zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_pwr.h
#if defined (PWR_CR6_VCPUMONEN)
/**
  * @brief  Enable/Disable monitoring of VDDcpu
  * @rmtoll CR6    PWR_CR6_VCPUMONEN       LL_PWREx_EnableVDDcpuMonitoring/LL_PWREx_DisableVDDcpuMonitoring
  */
__STATIC_INLINE void LL_PWREx_EnableVDDcpuMonitoring(void)
{
  SET_BIT(PWR->CR6, PWR_CR6_VCPUMONEN);
}
__STATIC_INLINE void LL_PWREx_DisableVDDcpuMonitoring(void)
{
  CLEAR_BIT(PWR->CR6, PWR_CR6_VCPUMONEN);
}
/**
  * @brief  return true if VDDcpu monitoring is enabled
  * @rmtoll CR6    PWR_CR6_VCPUMONEN       LL_PWREx_IsEnabledVDDcpuMonitoring
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWREx_IsEnabledVDDcpuMonitoring(void)
{
  return ((READ_BIT(PWR->CR6, PWR_CR6_VCPUMONEN) == (PWR_CR6_VCPUMONEN)) ? 1UL : 0UL);
}


/**
  * @brief  Enable/Disable overdrive  VDDcpu low threshold
  * @rmtoll CR6    PWR_CR6_VCPULLS       LL_PWREx_EnableVDDcpuODriveThreshold/LL_PWREx_DisableVDDcpuODriveThreshold
  */
__STATIC_INLINE void LL_PWREx_EnableVDDcpuODriveThreshold(void)
{
  SET_BIT(PWR->CR6, PWR_CR6_VCPULLS);
}
__STATIC_INLINE void LL_PWREx_DisableVDDcpuODriveThreshold(void)
{
  CLEAR_BIT(PWR->CR6, PWR_CR6_VCPULLS);
}
/**
  * @brief  return true if overdrive  VDDcpu low threshold is enabled
  * @rmtoll CR6    PWR_CR6_VCPULLS       LL_PWREx_IsEnabledVDDcpuMonitoring
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWREx_IsEnabledVDDcpuODriveThreshold(void)
{
  return ((READ_BIT(PWR->CR6, PWR_CR6_VCPULLS) == (PWR_CR6_VCPULLS)) ? 1UL : 0UL);
}


/**
  * @brief  return true if VDDcpu level is equal or below low threshold (flag VCPUL set)
  * @rmtoll CR6   PWR_CR6_VCPUL  LL_PWR_IsActiveFlag_VCPUL
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VCPUL(void)
{
  return ((READ_BIT(PWR->CR6, PWR_CR6_VCPUL) == (PWR_CR6_VCPUL)) ? 1UL : 0UL);
}

/**
  * @brief  return true if VDDcpu level is equal or above high threshold (flag VCPUH set)
  * @rmtoll CR6   PWR_CR6_VCPUH       LL_PWR_IsActiveFlag_VCPUH
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VCPUH(void)
{
  return ((READ_BIT(PWR->CR6, PWR_CR6_VCPUH) == (PWR_CR6_VCPUH)) ? 1UL : 0UL);
}
#endif /* PWR_CR6_VCPUMONEN */

#if defined(PWR_CR12_VDDGPURDY)
/**
  * @brief  Enable/Disable monitoring of VDDgpu
  *         Warning, VDDgpu external voltage may need to be set ON before using.
  *         For instance on Valid3 board, SW shall set VDDgpu ON with GPIO-B13 (VDDgpu is ON if GPIO-B13 is high)
  * @rmtoll CR12    PWR_CR12_GPUVMEN       LL_PWR_EnableVDDgpuMonitoring/LL_PWR_DisableVDDgpuMonitoring
  */
__STATIC_INLINE void LL_PWR_EnableVDDgpuMonitoring(void)
{
  SET_BIT(PWR->CR12, PWR_CR12_GPUVMEN);
}
__STATIC_INLINE void LL_PWR_DisableVDDgpuMonitoring(void)
{
  CLEAR_BIT(PWR->CR12, PWR_CR12_GPUVMEN);
}
/**
  * @brief  return true if VDDgpu monitoring is enabled
  * @rmtoll CR12   PWR_CR12_GPUVMEN       LL_PWR_IsVDDgpuMonitoringEnabled
  *         Warning, VDDgpu external voltage may need to be set ON before using.
  *         For instance on Valid3 board, SW shall set VDDgpu ON with GPIO-B13 (VDDgpu is ON if GPIO-B13 is high)
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsVDDgpuMonitoringEnabled(void)
{
  return ((READ_BIT(PWR->CR12, PWR_CR12_GPUVMEN) == (PWR_CR12_GPUVMEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable/Disable  VDDgpu low threshold
  * @rmtoll CR12    PWR_CR12_GPULVTEN       LL_PWR_EnableVDDgpuLowThreshold/LL_PWR_DisableVDDgpuLowThreshold
  */
__STATIC_INLINE void LL_PWR_EnableVDDgpuLowThreshold(void)
{
  SET_BIT(PWR->CR12, PWR_CR12_GPULVTEN);
}
__STATIC_INLINE void LL_PWR_DisableVDDgpuLowThreshold(void)
{
  CLEAR_BIT(PWR->CR12, PWR_CR12_GPULVTEN);
}
/**
  * @brief  return true if VDDgpu low Threshold is enabled
  * @rmtoll CR12   PWR_CR12_GPULVTEN       LL_PWR_IsEnabledVDDgpuThreshold
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVDDgpuLowThreshold(void)
{
  return ((READ_BIT(PWR->CR12, PWR_CR12_GPULVTEN) == (PWR_CR12_GPULVTEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable/Disable  VDDgpu independent supply valid (present)
  * @rmtoll PWR_CR12_GPUSV  LL_PWR_EnableVDDgpuSupplyValidation/LL_PWR_DisableVDDgpuSupplyValidation
  */
__STATIC_INLINE void LL_PWR_EnableVDDgpuValidation(void)
{
  SET_BIT(PWR->CR12, PWR_CR12_GPUSV);
}
__STATIC_INLINE void LL_PWR_DisableVDDgpuValidation(void)
{
  CLEAR_BIT(PWR->CR12, PWR_CR12_GPUSV);
}
/**
  * @brief  return true if VDDgpu independent supply  valid (present) is enabled
  * @rmtoll CR12   PWR_CR12_GPUSV       LL_PWR_IsVDDgpuSupplyValidationEnabled
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsVDDgpuValidationEnabled(void)
{
  return ((READ_BIT(PWR->CR12, PWR_CR12_GPUSV) == (PWR_CR12_GPUSV)) ? 1UL : 0UL);
}

/**
  * @brief  return true if VDDgpu is equal or below threshold (flag VDDGPURDY set)
  * @note   irrelevant if no threshold enabled
  * @rmtoll CR12   PWR_CR12_VDDGPURDY       LL_PWR_IsVDDgpuSupplyReady
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsVDDgpuReady(void)
{
  return ((READ_BIT(PWR->CR12, PWR_CR12_VDDGPURDY) == (PWR_CR12_VDDGPURDY)) ? 1UL : 0UL);
}

#endif /* defined(PWR_CR12_VDDGPURDY) */

#if !defined(CORE_CM0PLUS)
#if defined(PWR_BDCR1_DBD3P)
/**
  * @brief  Enable/Disable W access to D3 and backup  resources
  * @rmtoll BDCR1          LL_PWR_EnableBkUpD3Access/LL_PWR_DisableBkUpD3Access
  */
__STATIC_INLINE void LL_PWR_EnableBkUpD3Access(void)
{
  SET_BIT(PWR->BDCR1, PWR_BDCR1_DBD3P);
}
__STATIC_INLINE void LL_PWR_DisableBkUpD3Access(void)
{
  CLEAR_BIT(PWR->BDCR1, PWR_BDCR1_DBD3P);
}

/**
  * @brief  return true if W access to D3 and backup domain is enabled
  * @rmtoll BDCR1          LL_PWR_IsEnabledBkUpD3Access
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledBkUpD3Access(void)
{
  return ((READ_BIT(PWR->BDCR1, PWR_BDCR1_DBD3P) == (PWR_BDCR1_DBD3P)) ? 1UL : 0UL);
}
#else
/**
  * @brief  Enable/Disable W access to backup  resources
  * @rmtoll BDCR          LL_PWR_EnableBkUpAccess/LL_PWR_DisableBkUpAccess
  */
__STATIC_INLINE void LL_PWR_EnableBkUpAccess(void)
{
  SET_BIT(PWR->BDCR, PWR_BDCR_DBP);
}
__STATIC_INLINE void LL_PWR_DisableBkUpAccess(void)
{
  CLEAR_BIT(PWR->BDCR, PWR_BDCR_DBP);
}

/**
  * @brief  return true if W access to backup domain is enabled
  * @rmtoll BDCR          LL_PWR_IsEnabledBkUpAccess
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledBkUpAccess(void)
{
  return ((READ_BIT(PWR->BDCR, PWR_BDCR_DBP) == (PWR_BDCR_DBP)) ? 1UL : 0UL);
}
#endif /* defined(PWR_BDCR1_DBD3P) */
#endif /*!defined(CORE_CM0PLUS)*/


