zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_pwr.h
#if defined(CORE_CM0PLUS)
/**
  * @brief  Enable/Disable W access to backup  resources
  * @rmtoll BDCR2          LL_PWR_EnableBkUpAccess/LL_PWR_DisableBkUpAccess
  */
__STATIC_INLINE void LL_PWR_EnableBkUpAccess(void)
{
  SET_BIT(PWR->BDCR2, PWR_BDCR2_DBP);
}
__STATIC_INLINE void LL_PWR_DisableBkUpAccess(void)
{
  CLEAR_BIT(PWR->BDCR2, PWR_BDCR2_DBP);
}

/**
  * @brief  return true if W access to backup domain is enabled
  * @rmtoll BDCR2          LL_PWR_IsEnabledBkUpAccess
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledBkUpAccess(void)
{
  return ((READ_BIT(PWR->BDCR2, PWR_BDCR2_DBP) == (PWR_BDCR2_DBP)) ? 1UL : 0UL);
}
#endif /*!defined(CORE_CM0PLUS)*/


#if !defined(CORE_CM0PLUS)
/**
  * @brief  Set/Get minimum guarantee duration of PWR_CPU_ON low pulse in DStandby
  * @rmtoll D1CR          LL_PWR_SetPwrCpuOnLowPulseDuration/LL_PWR_GetPwrCpuOnLowPulseDuration
  * @param  duration This parameter can be one of the following values:
  *         @arg 00000 no duration guarantee
  *         @arg 00001 1*32LSI-cycle duration guaranteed
  *         @arg 00010 2*32LSI-cycle duration guaranteed
  *         @arg ..... duration guaranteed
  *         @arg 11111 31*32LSI-cycle duration guaranteed
  */
__STATIC_INLINE void LL_PWR_SetPwrCpuOnLowPulseDuration(uint32_t duration)
{
  MODIFY_REG(PWR->D1CR, PWR_D1CR_POPL_D1, duration << PWR_D1CR_POPL_D1_Pos);
}
__STATIC_INLINE uint32_t  LL_PWR_GetPwrCpuOnLowPulseDuration(void)
{
  return ((READ_REG(PWR->D1CR) & (PWR_D1CR_POPL_D1)) >> PWR_D1CR_POPL_D1_Pos) ;
}


/**
  * @brief  Set/Get PWR_CPU_ON configuration
  * @rmtoll D1CR          LL_PWR_SetPwrCpuOnConfig/LL_PWR_GetPwrCpuOnConfig
  * @param  configuration This parameter can be one of the following values:
  *         @arg 0 PWR_CPU_ON is low only in DStandby
  *         @arg 1 PWR_CPU_ON is low only in DStandby and DStop2/3
  */
__STATIC_INLINE void LL_PWR_SetPwrCpuOnConfig(uint32_t configuration)
{
  MODIFY_REG(PWR->D1CR, PWR_D1CR_LPCFG_D1, configuration);
}
__STATIC_INLINE uint32_t  LL_PWR_GetPwrCpuOnConfig(void)
{
  return ((READ_REG(PWR->D1CR) & (PWR_D1CR_LPCFG_D1)));
}


/**
  * @brief  Set/Get  the delay to maintain  PWR_ON High when entering  in DStandby
  * @rmtoll D2CR          LL_PWR_SetPwrOnHighDelay/LL_PWR_GetPwrOnHighDelay
  * @param  delay This parameter can be one of the following values:
  *         @arg 00000 no delay  observed
  *         @arg 00001 1*32LSI-cycle delay  observed
  *         @arg 00010 2*32LSI-cycle delay  observed
  *         @arg ..... delay  observed
  *         @arg 11111 31*32LSI-cycle delay  observed
  */
__STATIC_INLINE void LL_PWR_SetPwrOnHighDelay(uint32_t delay)
{
  MODIFY_REG(PWR->D2CR, PWR_D2CR_PODH_D2, delay << PWR_D2CR_PODH_D2_Pos);
}
__STATIC_INLINE uint32_t  LL_PWR_GetPwrOnHighDelay(void)
{
  return ((READ_REG(PWR->D2CR) & (PWR_D2CR_PODH_D2)) >> PWR_D2CR_PODH_D2_Pos) ;
}

/**
  * @brief  Set/Get  the minimum delay to be observed before activation of PLLs after one of the LPLV system Stop
  * @rmtoll D2CR          LL_PWR_SetPllLpLvStopDelay/LL_PWR_GetPllLpLvStopDelay
  * @param  delay This parameter can be one of the following values:
  *         @arg 00000 no delay  observed
  *         @arg 00001 1*6LSI-cycle delay  observed
  *         @arg 00010 2*6LSI-cycle delay  observed
  *         @arg ..... delay  observed
  *         @arg 11111 31*6LSI-cycle delay  observed
  */
__STATIC_INLINE void LL_PWR_SetPllLpLvStopDelay(uint32_t delay)
{
  MODIFY_REG(PWR->D2CR, PWR_D2CR_LPLVDLY_D2, delay << PWR_D2CR_LPLVDLY_D2_Pos);
}
__STATIC_INLINE uint32_t  LL_PWR_GetPllLpLvStopDelay(void)
{
  return ((READ_REG(PWR->D2CR) & (PWR_D2CR_LPLVDLY_D2)) >> PWR_D2CR_LPLVDLY_D2_Pos) ;
}

/**
  * @brief  Set/Get minimum guarantee duration of PWR_ON low pulse in DStandby
  * @rmtoll D2CR          LL_PWR_SetPwrOnLowPulseDuration/LL_PWR_GetPwrOnLowPulseDuration
  * @param  duration This parameter can be one of the following values:
  *         @arg 00000 no duration guarantee
  *         @arg 00001 1*32LSI-cycle duration guaranteed
  *         @arg 00010 2*32LSI-cycle duration guaranteed
  *         @arg .... duration guaranteed
  *         @arg 11111 31*32LSI-cycle duration guaranteed
  */
__STATIC_INLINE void LL_PWR_SetPwrOnLowPulseDuration(uint32_t duration)
{
  MODIFY_REG(PWR->D2CR, PWR_D2CR_POPL_D2, duration << PWR_D2CR_POPL_D2_Pos);
}
__STATIC_INLINE uint32_t  LL_PWR_GetPwrOnLowPulseDuration(void)
{
  return ((READ_REG(PWR->D2CR) & (PWR_D2CR_POPL_D2)) >> PWR_D2CR_POPL_D2_Pos) ;
}


/**
  * @brief  Set/Get PWR_ON configuration
  * @rmtoll D2CR          LL_PWR_SetPwrOnConfig/LL_PWR_GetPwrOnConfig
  * @param  configuration This parameter can be one of the following values:
  *         @arg 0 PWR_ON is low only in Standby1/2
  *         @arg 1 PWR_ON is low only in Standby1/2 and LPLV-Stop1/2 and Stop1/2
  */
__STATIC_INLINE void LL_PWR_SetPwrOnConfig(uint32_t configuration)
{
  MODIFY_REG(PWR->D2CR, PWR_D2CR_LPCFG_D2, configuration);
}
__STATIC_INLINE uint32_t  LL_PWR_GetPwrOnConfig(void)
{
  return ((READ_REG(PWR->D2CR)) & (PWR_D2CR_LPCFG_D2)) ;
}
#endif /*!defined(CORE_CM0PLUS)*/


/**
  * @}
  */


/** @defgroup PWR_LL_EF_PwrState PwrState
  * @{
  */


/**
  * @brief  Allow/Deny D1 domain to enter standby when CPU1 enters Cstop
  * @rmtoll CPU1CR           LL_PWR_CPU1_AllowD1standby/LL_PWR_CPU1_DenyD1standby
  */
__STATIC_INLINE void LL_PWR_CPU1_AllowD1standby(void)
{
  SET_BIT(PWR->CPU1CR, PWR_CPU1CR_PDDS_D1);
}
__STATIC_INLINE void LL_PWR_CPU1_DenyD1standby(void)
{
  CLEAR_BIT(PWR->CPU1CR, PWR_CPU1CR_PDDS_D1);
}

/**
  * @brief  return true if CPU1 allows D1 standby when entering in Cstop
  * @rmtoll CPU1CR          LL_PWR_IsAllowedCPU1D1standby
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsAllowedCPU1D1standby(void)
{
  return ((READ_BIT(PWR->CPU1CR, PWR_CPU1CR_PDDS_D1) == (PWR_CPU1CR_PDDS_D1)) ? 1UL : 0UL);
}

/**
  * @brief  Allow/Deny D2 domain to enter standby when CPU1 enters Cstop
  * @rmtoll CPU1CR           LL_PWR_CPU1_AllowD2standby/LL_PWR_CPU1_DenyD2standby
  */
__STATIC_INLINE void LL_PWR_CPU1_AllowD2standby(void)
{
  SET_BIT(PWR->CPU1CR, PWR_CPU1CR_PDDS_D2);
}
__STATIC_INLINE void LL_PWR_CPU1_DenyD2standby(void)
{
  CLEAR_BIT(PWR->CPU1CR, PWR_CPU1CR_PDDS_D2);
}

/**
  * @brief  return true if CPU1 allows D2 standby when entering in Cstop
  * @rmtoll CPU1CR          LL_PWR_IsAllowedCPU1D2standby
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsAllowedCPU1D2standby(void)
{
  return ((READ_BIT(PWR->CPU1CR, PWR_CPU1CR_PDDS_D2) == (PWR_CPU1CR_PDDS_D2)) ? 1UL : 0UL);
}


/**
  * @brief  Allow/Deny D2 domain to enter standby when CPU2 enters Cstop
  * @rmtoll CPU2CR           LL_PWR_CPU2_AllowD2standby/LL_PWR_CPU2_DenyD2standby
  */
__STATIC_INLINE void LL_PWR_CPU2_AllowD2standby(void)
{
  SET_BIT(PWR->CPU2CR, PWR_CPU1CR_PDDS_D2);
}
__STATIC_INLINE void LL_PWR_CPU2_DenyD2standby(void)
{
  CLEAR_BIT(PWR->CPU2CR, PWR_CPU1CR_PDDS_D2);
}


/**
  * @brief  return true if CPU2 allows D2 standby when entering in Cstop
  * @rmtoll CPU2CR          LL_PWR_IsAllowedCPU2D2standby
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsAllowedCPU2D2standby(void)
{
  return ((READ_BIT(PWR->CPU2CR, PWR_CPU2CR_PDDS_D2) == (PWR_CPU2CR_PDDS_D2)) ? 1UL : 0UL);
}

#if defined(PWR_D3CR_PDDS_D3)
/**
  * @brief  Allow/Deny D3 domain to enter standby when system  enters standby
  * @rmtoll CPU2CR           LL_PWR_AllowD3standby/LL_PWR_DenyD3standby
  */
__STATIC_INLINE void LL_PWR_AllowD3standby(void)
{
  SET_BIT(PWR->D3CR, PWR_D3CR_PDDS_D3);
}
__STATIC_INLINE void LL_PWR_DenyD3standby(void)
{
  CLEAR_BIT(PWR->D3CR, PWR_D3CR_PDDS_D3);
}

/**
  * @brief  return true if D3 standby allowed
  * @rmtoll D3CR          LL_PWR_IsAllowedD3standby
  * @retval boolean
  */
__STATIC_INLINE uint32_t LL_PWR_IsAllowedD3standby(void)
{
  return ((READ_BIT(PWR->D3CR, PWR_D3CR_PDDS_D3) == (PWR_D3CR_PDDS_D3)) ? 1UL : 0UL);
}

/**
  * @brief  Check if D3 supply is ready
  * @rmtoll D3CR            LL_PWR_IsActiveFlag_D3RDY
  * @retval Return true if D3 supply is ready
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_D3RDY(void)
{
  return ((READ_BIT(PWR->D3CR, PWR_D3CR_D3RDY) == PWR_D3CR_D3RDY) ? 1UL : 0UL);
}
#endif /* defined(PWR_D3CR_PDDS_D3) */
/**
  * @brief  return true if CPU#i is in CRUn or CSleep state
  * @rmtoll CPU1CR/CPU2CR/CPU3CR           LL_PWR_Is_CPU1_Active/LL_PWR_Is_CPU2_Active/LL_PWR_Is_CPU3_Active
  */
__STATIC_INLINE uint32_t LL_PWR_Is_CPU1_Active(void)
{
  return ((READ_BIT(PWR->CPU1CR, PWR_CPU1CR_STANDBYWFIL2) == (PWR_CPU1CR_STANDBYWFIL2)) ? 0UL : 1UL);
}
__STATIC_INLINE uint32_t LL_PWR_Is_CPU2_Active(void)
{
  return ((READ_BIT(PWR->CPU2CR, PWR_CPU2CR_DEEPSLEEP) == (PWR_CPU2CR_DEEPSLEEP)) ? 0UL : 1UL);
}
#if defined(PWR_CPU3CR_DEEPSLEEP)
__STATIC_INLINE uint32_t LL_PWR_Is_CPU3_Active(void)
{
  return ((READ_BIT(PWR->CPU3CR, PWR_CPU3CR_DEEPSLEEP) == (PWR_CPU3CR_DEEPSLEEP)) ? 0UL : 1UL);
}
#endif /* defined(PWR_CPU3CR_DEEPSLEEP) */
/**
  * @brief  return  CPU#i state
  * @note  CPU state can be one of the following values:
  *        LL_PWR_CPU_RESET
  *        LL_PWR_CPU_CRUN
  *        LL_PWR_CPU_CSLEEP
  *        LL_PWR_CPU_CSTOP
  * @rmtoll CPU1D1SR/CPU2D2SR/CPU3D3SR           LL_PWR_CPU1State/LL_PWR_CPU2State/LL_PWR_CPU3State
  */
__STATIC_INLINE uint32_t LL_PWR_CPU1State(void)
{
  return ((READ_REG(PWR->CPU1D1SR) & PWR_CPU1D1SR_CSTATE) >> PWR_CPU1D1SR_CSTATE_Pos);
}
__STATIC_INLINE uint32_t LL_PWR_CPU2State(void)
{
  return ((READ_REG(PWR->CPU2D2SR) & PWR_CPU2D2SR_CSTATE) >> PWR_CPU2D2SR_CSTATE_Pos);
}
#if defined(PWR_CPU3D3SR_CSTATE)
__STATIC_INLINE uint32_t LL_PWR_CPU3State(void)
{
  return ((READ_REG(PWR->CPU3D3SR) & PWR_CPU3D3SR_CSTATE) >> PWR_CPU3D3SR_CSTATE_Pos);
}
#endif /* defined(PWR_CPU3D3SR_CSTATE) */

/**
  * @brief  return  D1 state
  * @note  D1 state can be one of the following values:
  *        LL_PWR_DRUN
  *        LL_PWR_DSTOP1
  *        LL_PWR_DSTOP2
  *        LL_PWR_DSTOP3
  *        LL_PWR_DSTANDBY
  * @rmtoll CPU1D1SR           LL_PWR_D1State
  */
__STATIC_INLINE uint32_t LL_PWR_D1State(void)
{
  return ((READ_REG(PWR->CPU1D1SR) & PWR_CPU1D1SR_DSTATE) >> PWR_CPU1D1SR_DSTATE_Pos);
}

/**
  * @brief  return  D2 state
  * @note  D2 state can be one of the following values:
  *        LL_PWR_RUN
  *        LL_PWR_STOP
  *        LL_PWR_LP_STOP
  *        LL_PWR_LPLV_STOP
  *        LL_PWR_STANDBY
  *        LL_PWR_VBAT
  * @rmtoll CPU2D2SR           LL_PWR_D2State
  */
__STATIC_INLINE uint32_t LL_PWR_D2State(void)
{
  return ((READ_REG(PWR->CPU2D2SR) & PWR_CPU2D2SR_DSTATE) >> PWR_CPU2D2SR_DSTATE_Pos);
}

#if defined(PWR_CPU3D3SR_DSTATE)
/**
  * @brief  return  D3 state
  * @note  D3 state can be one of the following values:
  *        LL_PWR_SRUN1
  *        LL_PWR_SRUN2
  *        LL_PWR_SRUN3
  *        LL_PWR_SSTOP1
  *        LL_PWR_SSTOP2
  *        LL_PWR_SSTANDBY
  * @rmtoll CPU3D3SR           LL_PWR_D3State
  */
__STATIC_INLINE uint32_t LL_PWR_D3State(void)
{
  return ((READ_REG(PWR->CPU3D3SR) & PWR_CPU3D3SR_DSTATE) >> PWR_CPU3D3SR_DSTATE_Pos);
}
#endif /* defined(PWR_CPU3D3SR_DSTATE) */

/**
  * @brief  return  true when domain D#i has been is standby
  * @note  shall be cleared by SW before D#i re-enters standby (note done by HW)
  * @rmtoll CPU1CR/CPU2CR/CPU3CR           LL_PWR_HasD1BeenInStandby/LL_PWR_HasD2BeenInStandby/LL_PWR_HasD3BeenInStandby
  */
__STATIC_INLINE uint32_t LL_PWR_HasD1BeenInStandby(void)
{
  return ((READ_BIT(PWR->CPU1CR, PWR_CPU1CR_SBF_D1) == (PWR_CPU1CR_SBF_D1)) ? 1UL : 0UL);
}
__STATIC_INLINE uint32_t LL_PWR_HasD2BeenInStandby(void)
{
  return ((READ_BIT(PWR->CPU2CR, PWR_CPU2CR_SBF_D2) == (PWR_CPU2CR_SBF_D2)) ? 1UL : 0UL);
}

#if defined(PWR_CPU3CR_SBF_D3)
__STATIC_INLINE uint32_t LL_PWR_HasD3BeenInStandby(void)
{
#if defined(CORE_CA35)
  return ((READ_BIT(PWR->CPU1CR, PWR_CPU1CR_SBF_D3) == (PWR_CPU1CR_SBF_D3)) ? 1UL : 0UL);
#endif /* CORE_CA35 */
#if defined(CORE_CM33)
  return ((READ_BIT(PWR->CPU2CR, PWR_CPU2CR_SBF_D3) == (PWR_CPU2CR_SBF_D3)) ? 1UL : 0UL);
#endif /* CORE_CM33 */
#if defined(CORE_CM0PLUS)
  return ((READ_BIT(PWR->CPU3CR, PWR_CPU3CR_SBF_D3) == (PWR_CPU3CR_SBF_D3)) ? 1UL : 0UL);
#endif /* CORE_CM0PLUS */
}
#endif /* defined(PWR_CPU3CR_SBF_D3) */

#if defined(CORE_CM33)||defined(CORE_CA35)
/**
  * @brief  return  true when system has been is stop
  * @note  shall be cleared by SW before system re-enters stop (note done by HW)
  * @rmtoll CPU1CR/CPU2CR          LL_PWR_HasSystemBeenInStandby
  */
__STATIC_INLINE uint32_t LL_PWR_HasSystemBeenInStop(void)
{
#if defined(CORE_CA35)
  return ((READ_BIT(PWR->CPU1CR, PWR_CPU1CR_STOPF) == (PWR_CPU1CR_STOPF)) ? 1UL : 0UL);
#endif /* CORE_CA35 */
#if defined(CORE_CM33)
  return ((READ_BIT(PWR->CPU2CR, PWR_CPU2CR_STOPF) == (PWR_CPU2CR_STOPF)) ? 1UL : 0UL);
#endif /* CORE_CM33 */

