zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_pwr.h
}

/**
  * @brief  return  true when system has been is standby
  * @note  shall be cleared by SW before system re-enters standby (note done by HW)
  * @rmtoll CPU1CR/CPU2CR          LL_PWR_HasSystemBeenInStandby
  */
__STATIC_INLINE uint32_t LL_PWR_HasSystemBeenInStandby(void)
{
#if defined(CORE_CA35)
  return ((READ_BIT(PWR->CPU1CR, PWR_CPU1CR_SBF) == (PWR_CPU1CR_SBF)) ? 1UL : 0UL);
#endif /* CORE_CA35 */
#if defined(CORE_CM33)
  return ((READ_BIT(PWR->CPU2CR, PWR_CPU2CR_SBF) == (PWR_CPU2CR_SBF)) ? 1UL : 0UL);
#endif /* CORE_CM33 */
}
#endif /*defined(CORE_CM33)||defined(CORE_CA35)*/

/**
  * @brief  return  true when system has been is vbat
  * @note  shall be cleared by SW before system re-enters vbat (note done by HW)
  * @rmtoll CPU1CR/CPU2CR/CPU3CR           LL_PWR_HasSystemBeenInVBAT
  */
__STATIC_INLINE uint32_t LL_PWR_HasSystemBeenInVBAT(void)
{
#if defined(CORE_CA35)
  return ((READ_BIT(PWR->CPU1CR, PWR_CPU1CR_VBF) == (PWR_CPU1CR_VBF)) ? 1UL : 0UL);
#endif /* CORE_CA35 */
#if defined(CORE_CM33)
  return ((READ_BIT(PWR->CPU2CR, PWR_CPU2CR_VBF) == (PWR_CPU2CR_VBF)) ? 1UL : 0UL);
#endif /* CORE_CM33 */
#if defined(CORE_CM0PLUS)
  return ((READ_BIT(PWR->CPU3CR, PWR_CPU3CR_VBF) == (PWR_CPU3CR_VBF)) ? 1UL : 0UL);
#endif /* CORE_CM0PLUS */
}

/**
  * @}
  */


/** @defgroup PWR_LL_EF_LpWkUp LpWkUp
  * @{
  */


/**
  * @brief  Enable/Disable CPU1/CPU2 power wakeup line
  * @rmtoll WKUPCRx LL_PWR_EnableCPU1WakeUpPin/LL_PWR_DisableCPU1WakeUpPin/LL_PWR_EnableCPU2WakeUpPin/
                    LL_PWR_DisableCPU2WakeUpPin
  * @param  WakeUpPinx This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN4
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN5
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN6
  */
__STATIC_INLINE void LL_PWR_EnableCPU1WakeUpPin(uint32_t WakeUpPinx)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->WKUPCR1 + (WKUPCR_ADD_OFFSET * WakeUpPinx); /* Selected register corresponding to input wakeup line*/
  SET_BIT(*regaddr, PWR_WKUPCR1_WKUPENCPU1);                   /* Enable  WKUP pinx interruption  CPU1 */
}
__STATIC_INLINE void LL_PWR_DisableCPU1WakeUpPin(uint32_t WakeUpPinx)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->WKUPCR1 + (WKUPCR_ADD_OFFSET * WakeUpPinx); /* Selected register corresponding to input wakeup line*/
  CLEAR_BIT(*regaddr, PWR_WKUPCR1_WKUPENCPU1);                /* Disable  WKUP pinx interruption  CPU1 */
}
__STATIC_INLINE void LL_PWR_EnableCPU2WakeUpPin(uint32_t WakeUpPinx)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->WKUPCR1 + (WKUPCR_ADD_OFFSET * WakeUpPinx); /*Selected register corresponding to input wakeup line*/
  SET_BIT(*regaddr, PWR_WKUPCR1_WKUPENCPU2);                  /* Enable  WKUP pinx interruption  CPU2 */
}
__STATIC_INLINE void LL_PWR_DisableCPU2WakeUpPin(uint32_t WakeUpPinx)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->WKUPCR1 + (WKUPCR_ADD_OFFSET * WakeUpPinx); /*Selected register corresponding to input wakeup line*/
  CLEAR_BIT(*regaddr, PWR_WKUPCR1_WKUPENCPU2);                /* Disable  WKUP pinx interruption  CPU2 */
}


/**
  * @brief  return  true when a pwr wake-up line is configured to wake-up CPU1 or CPU2
  * @note  shall be cleared by SW before system re-enters stop (note done by HW)
  * @rmtoll WKUPCRx          LL_PWR_IsCPU1WakeUpCapable/LL_PWR_IsCPU2WakeUpCapable
  * @param  WakeUpPinx This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN4
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN5
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN6
  */
__STATIC_INLINE uint32_t LL_PWR_IsCPU1WakeUpCapable(uint32_t WakeUpPinx)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->WKUPCR1 + (WKUPCR_ADD_OFFSET * WakeUpPinx); /*Selected register corresponding to input wakeup line*/
  return ((READ_BIT(*regaddr, PWR_WKUPCR1_WKUPENCPU1) == (PWR_WKUPCR1_WKUPENCPU1)) ? 1UL : 0UL);
}
__STATIC_INLINE uint32_t LL_PWR_IsCPU2WakeUpCapable(uint32_t WakeUpPinx)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->WKUPCR1 + (WKUPCR_ADD_OFFSET * WakeUpPinx); /*Selected register corresponding to input wakeup line*/
  return ((READ_BIT(*regaddr, PWR_WKUPCR1_WKUPENCPU2) == (PWR_WKUPCR1_WKUPENCPU2)) ? 1UL : 0UL);
}


/**
  * @brief  Set/Get polarity of a wakeup pin
  * @rmtoll WKUPCRx LL_PWR_SetWakeUpPinPolarityLow/LL_PWR_SetWakeUpPinPolarityHigh/LL_PWR_IsEnabledWakeUpPinPolarityLow
  * @param  WakeUpPinx This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN4
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN5
  *         @arg @ref LL_PWR_WAKEUP_PIN_PIN6
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPolarityLow(uint32_t WakeUpPinx)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->WKUPCR1 + (WKUPCR_ADD_OFFSET * WakeUpPinx); /*Selected register corresponding to input wakeup line*/
  SET_BIT(*regaddr, PWR_WKUPCR1_WKUPP);
}
__STATIC_INLINE void LL_PWR_SetWakeUpPinPolarityHigh(uint32_t WakeUpPinx)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->WKUPCR1 + (WKUPCR_ADD_OFFSET * WakeUpPinx); /*Selected register corresponding to input wakeup line*/
  CLEAR_BIT(*regaddr, PWR_WKUPCR1_WKUPP);
}

__STATIC_INLINE uint32_t LL_PWR_IsEnabledWakeUpPinPolarityLow(uint32_t WakeUpPinx)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->WKUPCR1 + (WKUPCR_ADD_OFFSET * WakeUpPinx); /*Selected register corresponding to input wakeup line*/
  return ((READ_BIT(*regaddr, PWR_WKUPCR1_WKUPP) == PWR_WKUPCR1_WKUPP) ? 1UL : 0UL);
}

/**
  * @brief  Set/Get  pull configuration of a wakeup pin
  * @rmtoll WKUPCRx          LL_PWR_SetWakeUpPinPullConfig/LL_PWR_GetWakeUpPinPullConfig
  * @param  WakeUpPinx This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_NOPULL
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULLUP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULLDOWN
  * @param  PullConfig This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULLUP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULLDOWN
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPullConfig(uint32_t WakeUpPinx, uint32_t PullConfig)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->WKUPCR1 + (WKUPCR_ADD_OFFSET * WakeUpPinx); /*Selected register corresponding to input wakeup line*/
  MODIFY_REG(*regaddr, PWR_WKUPCR1_WKUPPUPD, PullConfig << PWR_WKUPCR1_WKUPPUPD_Pos);
}


__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPinPullConfig(uint32_t WakeUpPinx)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->WKUPCR1 + (WKUPCR_ADD_OFFSET * WakeUpPinx); /*Selected register corresponding to input wakeup line*/
  return ((READ_REG(*regaddr) & (PWR_WKUPCR1_WKUPPUPD)) >> PWR_WKUPCR1_WKUPPUPD_Pos) ;
}

#if defined(PWR_D3WKUPENR_TAMP_WKUPEN_D3)
#if !defined(CORE_CM0PLUS)
/**
  * @brief  Enable/Disable  D3 wake-up from VBat thru external TAMPER
  * @rmtoll D3WKUPENR          LL_PWR_EnableD3WkUpTamper/LL_PWR_DisableD3WkUpTamper
  */
__STATIC_INLINE void LL_PWR_EnableD3WkUpTamper(void)
{
  SET_BIT(PWR->D3WKUPENR, PWR_D3WKUPENR_TAMP_WKUPEN_D3);
}
__STATIC_INLINE void LL_PWR_DisableD3WkUpTamper(void)
{
  CLEAR_BIT(PWR->D3WKUPENR, PWR_D3WKUPENR_TAMP_WKUPEN_D3);
}

/**
  * @brief  Check if D3 wake-up from VBat thru external TAMPER is set
  * @rmtoll D3WKUPENR          LL_PWR_IsEnabledD3WkUpTamper
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledD3WkUpTamper(void)
{
  return ((READ_BIT(PWR->D3WKUPENR, PWR_D3WKUPENR_TAMP_WKUPEN_D3) == PWR_D3WKUPENR_TAMP_WKUPEN_D3) ? 1U : 0U);
}

#endif /*!defined(CORE_CM0PLUS)*/
#endif /* defined(PWR_D3WKUPENR_TAMP_WKUPEN_D3) */

/**
  * @}
  */


/** @defgroup PWR_LL_EF_Rif Rif
  * @{
  */


/*                           non shareable  resource   RIF management                   */


/**
  * @brief  Set/Get secure attribute  to access  a or several non shareable resource(s)
  * @rmtoll RSECCFGR          LL_PWR_ConfigSecureNSharable/LL_PWR_GetConfigSecureNSharable
  * @param  SecureConfig : bit map of non shareable resource  : bit_k set if configuration applies
                           on non shareable resource k , k  in LL_R0 .. LL_R6
  */
__STATIC_INLINE void LL_PWR_ConfigSecureNSharable(uint32_t SecureConfig)
{
  WRITE_REG(PWR->RSECCFGR, SecureConfig);
}
__STATIC_INLINE uint32_t LL_PWR_GetConfigSecureNSharable(void)
{
  return (READ_REG(PWR->RSECCFGR));
}


/**
  * @brief  Set/Get privilege attribute  to access  a or several non shareable resource(s)
  * @rmtoll RPRIVCFGR          LL_PWR_ConfigPrivilegeNSharable/LL_PWR_GetConfigPrivilegeNSharable
  * @param  PrivilegeConfig : bit map of non shareable resource  : bit_k set if configuration applies
                              on non shareable resource k , k  in LL_R0 .. LL_R6
  */
__STATIC_INLINE void LL_PWR_ConfigPrivilegeNSharable(uint32_t PrivilegeConfig)
{
  WRITE_REG(PWR->RPRIVCFGR, PrivilegeConfig);
}
__STATIC_INLINE uint32_t LL_PWR_GetConfigPrivilegeNSharable(void)
{
  return (READ_REG(PWR->RPRIVCFGR));
}


/**
  * @brief  Set  authorised  CID for  accessing a non shareable resource
  * @note relevant only in case of  CID filtering active on input resource
  * @rmtoll RxCIDCFGR          LL_PWR_setAuthorisedCidNSharable
  * @param  nsRessource : R resource number  LL_R0 .. LL_R7
  * @param  cid : authorised cid value   0 .. 7
  */
__STATIC_INLINE void LL_PWR_SetAuthorisedCidNSharable(uint16_t nsRessource, uint16_t cid)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->RxCIDCFGR[0] + (R_CID_CFG_ADD_OFFSET * nsRessource);
  MODIFY_REG(*regaddr, PWR_R0CIDCFGR_SCID, ((uint32_t)cid << PWR_R0CIDCFGR_SCID_Pos));
}


/**
  * @brief  Get  authorised  CID for  accessing a non shareable resource
  * @note relevant only in case of  CID filtering active on input resource
  * @rmtoll RxCIDCFGR          LL_PWR_getAuthorisedCidNSharable
  * @param  nsRessource : R resource number  LL_R0 .. LL_R7
  * @retval cid  0 .. 7
  */
__STATIC_INLINE uint32_t LL_PWR_GetAuthorisedCidNSharable(uint16_t nsRessource)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->RxCIDCFGR[0] + (R_CID_CFG_ADD_OFFSET * nsRessource);
  return ((READ_REG(*regaddr) & (PWR_R0CIDCFGR_SCID)) >> PWR_R0CIDCFGR_SCID_Pos) ;
}


/**
  * @brief  Enable/Disable  CID filtering  to  control non shareable resource access
  * @rmtoll RxCIDCFGR          LL_PWR_EnableCidFilteringNsRessource/LL_PWR_DisableCidFilteringNsRessource
  * @param  nsRessource : R resource number  LL_R0 .. LL_R7
  */
__STATIC_INLINE void LL_PWR_EnableCidFilteringNSharable(uint16_t nsRessource)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->RxCIDCFGR[0] + (R_CID_CFG_ADD_OFFSET * nsRessource);
  SET_BIT(*regaddr, PWR_R0CIDCFGR_CFEN);
}
__STATIC_INLINE void LL_PWR_DisableCidFilteringNSharable(uint16_t nsRessource)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->RxCIDCFGR[0] + (R_CID_CFG_ADD_OFFSET * nsRessource);
  CLEAR_BIT(*regaddr, PWR_R0CIDCFGR_CFEN);
}

/**
  * @brief  Check if CID filtering  to  control non shareable resource access is enabled.
  * @rmtoll RxCIDCFGR              LL_PWR_IsCidFilteringNSharableEnabled
  * @param  nsRessource : R resource number  LL_R0 .. LL_R7
  * @retval true is semaphore enabled
  */
__STATIC_INLINE uint32_t LL_PWR_IsCidFilteringNSharableEnabled(uint16_t nsRessource)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->RxCIDCFGR[0] + (R_CID_CFG_ADD_OFFSET * nsRessource);
  return ((READ_BIT(*regaddr, PWR_R0CIDCFGR_CFEN) == PWR_R0CIDCFGR_CFEN) ? 1UL : 0UL);
}

