zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_pwr.h
/*                           WAKE-UP resource   RIF management   */

/**
  * @brief  Set/Get secure attribute  to access  a or several Wakeup resource(s)
  * @rmtoll WIOSECCFGR          LL_PWR_ConfigSecureWakeUp/LL_PWR_GetConfigSecureWakeUpvoid
  * @param  SecureConfig : bit map of wakeup resource  : bit_k set if configuration applies on wakeup resource k+1 ,
                           k  in LL_WIO1 .. LL_WIO6
  */
__STATIC_INLINE void LL_PWR_ConfigSecureWakeUp(uint32_t SecureConfig)
{
  WRITE_REG(PWR->WIOSECCFGR, SecureConfig);
}
__STATIC_INLINE uint32_t LL_PWR_GetConfigSecureWakeUp(void)
{
  return (READ_REG(PWR->WIOSECCFGR));
}


/**
  * @brief  Set/Get privilege attribute filtering to access  a or several Wakeup resource(s)
  * @rmtoll WIOPRIVCFGR          LL_PWR_ConfigPrivilegeWakeUp/LL_PWR_GetConfigPrivilegeWakeUp
  * @param  PrivilegeConfig : bit map of wakeup resource  : bit_k set if configuration applies on wakeup resource k+1 ,
                              k  in LL_WIO1 .. LL_WIO6
  */
__STATIC_INLINE void LL_PWR_ConfigPrivilegeWakeUp(uint32_t PrivilegeConfig)
{
  WRITE_REG(PWR->WIOPRIVCFGR, PrivilegeConfig);
}
__STATIC_INLINE uint32_t LL_PWR_GetConfigPrivilegeWakeUp(void)
{
  return (READ_REG(PWR->WIOPRIVCFGR));
}


/**
  * @brief  Set  authorised static CID for  accessing a Wakeup resource
  * @note relevant only in case of  CID filtering active on input resource and no semaphore enabled on it
  * @rmtoll WIOxCIDCFGR          LL_PWR_SetAuthorisedStaticCidWakeUp
  * @param  wkRessource : WIO resource number  LL_WIO1 .. LL_WIO6
  * @param  cid : authorised cid value   0 .. 7
  */
__STATIC_INLINE void LL_PWR_SetAuthorisedStaticCidWakeUp(uint16_t wkRessource, uint16_t cid)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->WIO1CIDCFGR + (WIO_CID_CFG_ADD_OFFSET * wkRessource);
  MODIFY_REG(*regaddr, PWR_WIO1CIDCFGR_SCID, ((uint32_t)cid << PWR_WIO1CIDCFGR_SCID_Pos));
}


/**
  * @brief  Get  authorised  static CID for  accessing a Wakeup resource
  * @note relevant only in case of  CID filtering active on input resource and no semaphore enabled on it
  * @rmtoll WIOxCIDCFGR          LL_PWR_GetAuthorisedStaticCidWakeUp
  * @param  wkRessource : WIO resource number  LL_WIO1 .. LL_WIO6
  * @retval cid  0 .. 7
  */
__STATIC_INLINE uint32_t LL_PWR_GetAuthorisedStaticCidWakeUp(uint16_t wkRessource)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->WIO1CIDCFGR + (WIO_CID_CFG_ADD_OFFSET * wkRessource);
  return ((READ_REG(*regaddr) & (PWR_WIO1CIDCFGR_SCID)) >> PWR_WIO1CIDCFGR_SCID_Pos) ;
}


/**
  * @brief  Set/Get   CID(s) enable to update semaphore  of a wake-up resource
  * @note  this function is unrelevant when no semaphore enable or CID filtering disable on input shared resource param
  * @rmtoll WIOxCIDCFGR          LL_PWR_ConfigSemaphore/LL_PWR_GetConfigSemaphore
  * @param  wkRessource : WIO resource number  LL_WIO1 .. LL_WIO6
  * @param  cidConfig : bit map of cid : bit_k set if cid k is authorized to acquire semaphore, k  in 0 .. 7

  */
__STATIC_INLINE void LL_PWR_ConfigSemaphore(uint16_t wkRessource, uint16_t cidConfig)
{
#define PWR_WIO1CIDCFGR_SEMWLC (PWR_WIO1CIDCFGR_SEMWLC0 | PWR_WIO1CIDCFGR_SEMWLC1 | PWR_WIO1CIDCFGR_SEMWLC2 | \
                                PWR_WIO1CIDCFGR_SEMWLC3 | PWR_WIO1CIDCFGR_SEMWLC4 | PWR_WIO1CIDCFGR_SEMWLC5 | \
                                PWR_WIO1CIDCFGR_SEMWLC6 | PWR_WIO1CIDCFGR_SEMWLC7 )

  __IO uint32_t *regaddr;

  regaddr = &PWR->WIO1CIDCFGR + (WIO_CID_CFG_ADD_OFFSET * wkRessource);
  MODIFY_REG(*regaddr, PWR_WIO1CIDCFGR_SEMWLC, ((uint32_t)cidConfig << PWR_WIO1CIDCFGR_SEMWLC0_Pos));
}
__STATIC_INLINE uint32_t LL_PWR_GetConfigSemaphore(uint16_t wkRessource)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->WIO1CIDCFGR + (WIO_CID_CFG_ADD_OFFSET * wkRessource);
  return (READ_REG(*regaddr) >> PWR_WIO1CIDCFGR_SEMWLC0_Pos);
}


/**
  * @brief  Enable/Disable  semaphore mechanism  to  control wakeup resource access
  * @rmtoll WIOxCIDCFGR          LL_PWR_EnableSemaphore/LL_PWR_ReleaseSemaphore
  * @param  wkRessource : WIO resource number  LL_WIO1 .. LL_WIO6
  */
__STATIC_INLINE void LL_PWR_EnableSemaphore(uint16_t wkRessource)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->WIO1CIDCFGR + (WIO_CID_CFG_ADD_OFFSET * wkRessource);
  SET_BIT(*regaddr, PWR_WIO1CIDCFGR_SEM_EN);
}
__STATIC_INLINE void LL_PWR_DisableSemaphore(uint16_t wkRessource)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->WIO1CIDCFGR + (WIO_CID_CFG_ADD_OFFSET * wkRessource);
  CLEAR_BIT(*regaddr, PWR_WIO1CIDCFGR_SEM_EN);
}

/**
  * @brief  Check if semaphore  for a wakeup resource is enabled.
  * @rmtoll WIOxCIDCFGR              LL_PWR_IsSemaphoreEnabled
  * @param  wkRessource : WIO resource number  LL_WIO1 .. LL_WIO6
  * @retval true is semaphore enabled
  */
__STATIC_INLINE uint32_t LL_PWR_IsSemaphoreEnabled(uint16_t wkRessource)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->WIO1CIDCFGR + (WIO_CID_CFG_ADD_OFFSET * wkRessource);
  return ((READ_BIT(*regaddr, PWR_WIO1CIDCFGR_SEM_EN) == PWR_WIO1CIDCFGR_SEM_EN) ? 1UL : 0UL);
}

/**
  * @brief  Enable/Disable  CID filtering  to  control wakeup resource access
  * @rmtoll WIOxCIDCFGR          LL_PWR_EnableCidFilteringWakeUp/LL_PWR_DisableCidFilteringWakeUp
  * @param  wkRessource : WIO resource number  LL_WIO1 .. LL_WIO6
  */
__STATIC_INLINE void LL_PWR_EnableCidFilteringWakeUp(uint16_t wkRessource)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->WIO1CIDCFGR + (WIO_CID_CFG_ADD_OFFSET * wkRessource);
  SET_BIT(*regaddr, PWR_WIO1CIDCFGR_CFEN);
}
__STATIC_INLINE void LL_PWR_DisableCidFilteringWakeUp(uint16_t wkRessource)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->WIO1CIDCFGR + (WIO_CID_CFG_ADD_OFFSET * wkRessource);
  CLEAR_BIT(*regaddr, PWR_WIO1CIDCFGR_CFEN);
}

/**
  * @brief  Check if CID filtering  to  control wake-upressource access is enabled.
  * @rmtoll WIOxCIDCFGR              LL_PWR_IsCidFilteringWakeUpEnabled
  * @param  wkRessource : WIO resource number  LL_WIO1 .. LL_WIO6
  * @retval true is semaphore enabled
  */
__STATIC_INLINE uint32_t LL_PWR_IsCidFilteringWakeUpEnabled(uint16_t wkRessource)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->WIO1CIDCFGR + (WIO_CID_CFG_ADD_OFFSET * wkRessource);
  return ((READ_BIT(*regaddr, PWR_WIO1CIDCFGR_CFEN) == PWR_WIO1CIDCFGR_CFEN) ? 1UL : 0UL);
}

/**
  * @brief  take/release  semaphore of a wake-up resource
  * @rmtoll WIOxSEMCR          LL_PWR_TakeSemaphore/LL_PWR_ReleaseSemaphore
  * @param  wkRessource : WIO resource number  LL_WIO1 .. LL_WIO6
  */
__STATIC_INLINE void LL_PWR_TakeSemaphore(uint16_t wkRessource)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->WIO1SEMCR + (WIO_CID_CFG_ADD_OFFSET * wkRessource);
  SET_BIT(*regaddr, PWR_WIO1SEMCR_SEM_MUTEX);
}
__STATIC_INLINE void LL_PWR_ReleaseSemaphore(uint16_t wkRessource)
{
  __IO uint32_t *regaddr;

  regaddr = &PWR->WIO1SEMCR + (WIO_CID_CFG_ADD_OFFSET * wkRessource);
  CLEAR_BIT(*regaddr, PWR_WIO1SEMCR_SEM_MUTEX);
}


/**
  * @brief  get CID of laster master which acquires  semaphore of a wake-up resource
  * @note returned value is relevant ONLY if semaphore is enable with CID filtering on input shared resource

  * @rmtoll WIOxSEMCR          LL_PWR_GetLastSuccessfullCid
  * @param  wkRessource : WIO resource number  LL_WIO1 .. LL_WIO6
  * @retval cid  range in  0 .. 7
  */
__STATIC_INLINE uint32_t LL_PWR_GetLastSuccessfullCid(uint16_t wkRessource)
{
  const __IO uint32_t *regaddr;

  regaddr = &PWR->WIO1SEMCR + (WIO_CID_CFG_ADD_OFFSET * wkRessource);
  return (READ_REG(*regaddr) >> PWR_WIO1SEMCR_SEMCID_Pos);
}


/**
  * @}
  */

/**
  * @}
  */


#if defined(USE_FULL_LL_DRIVER)
/** @defgroup PWR_LL_Exported_Functions PWR Exported Functions
  * @{
  */
/** @defgroup PWR_LL_EF_Init De-initialization function
  * @{
  */
ErrorStatus LL_PWR_DeInit(void);
/**
  * @}
  */
/**
  * @}
*/
#endif /* USE_FULL_LL_DRIVER */


/**
  * @}
  */

#endif /* defined(PWR) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP2xx_LL_PWR_H */
